{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "adhirasam",
    "1": "aloo_gobi",
    "2": "aloo_matar",
    "3": "aloo_methi",
    "4": "aloo_shimla_mirch",
    "5": "aloo_tikki",
    "6": "anarsa",
    "7": "ariselu",
    "8": "bandar_laddu",
    "9": "basundi",
    "10": "bhatura",
    "11": "bhindi_masala",
    "12": "biryani",
    "13": "boondi",
    "14": "butter_chicken",
    "15": "chak_hao_kheer",
    "16": "cham_cham",
    "17": "chana_masala",
    "18": "chapati",
    "19": "chhena_kheeri",
    "20": "chicken_razala",
    "21": "chicken_tikka",
    "22": "chicken_tikka_masala",
    "23": "chikki",
    "24": "daal_baati_churma",
    "25": "daal_puri",
    "26": "dal_makhani",
    "27": "dal_tadka",
    "28": "dharwad_pedha",
    "29": "doodhpak",
    "30": "double_ka_meetha",
    "31": "dum_aloo",
    "32": "gajar_ka_halwa",
    "33": "gavvalu",
    "34": "ghevar",
    "35": "gulab_jamun",
    "36": "imarti",
    "37": "jalebi",
    "38": "kachori",
    "39": "kadai_paneer",
    "40": "kadhi_pakoda",
    "41": "kajjikaya",
    "42": "kakinada_khaja",
    "43": "kalakand",
    "44": "karela_bharta",
    "45": "kofta",
    "46": "kuzhi_paniyaram",
    "47": "lassi",
    "48": "ledikeni",
    "49": "litti_chokha",
    "50": "lyangcha",
    "51": "maach_jhol",
    "52": "makki_di_roti_sarson_da_saag",
    "53": "malapua",
    "54": "misi_roti",
    "55": "misti_doi",
    "56": "modak",
    "57": "mysore_pak",
    "58": "naan",
    "59": "navrattan_korma",
    "60": "palak_paneer",
    "61": "paneer_butter_masala",
    "62": "phirni",
    "63": "pithe",
    "64": "poha",
    "65": "poornalu",
    "66": "pootharekulu",
    "67": "qubani_ka_meetha",
    "68": "rabri",
    "69": "ras_malai",
    "70": "rasgulla",
    "71": "sandesh",
    "72": "shankarpali",
    "73": "sheer_korma",
    "74": "sheera",
    "75": "shrikhand",
    "76": "sohan_halwa",
    "77": "sohan_papdi",
    "78": "sutar_feni",
    "79": "unni_appam"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "adhirasam": 0,
    "aloo_gobi": 1,
    "aloo_matar": 2,
    "aloo_methi": 3,
    "aloo_shimla_mirch": 4,
    "aloo_tikki": 5,
    "anarsa": 6,
    "ariselu": 7,
    "bandar_laddu": 8,
    "basundi": 9,
    "bhatura": 10,
    "bhindi_masala": 11,
    "biryani": 12,
    "boondi": 13,
    "butter_chicken": 14,
    "chak_hao_kheer": 15,
    "cham_cham": 16,
    "chana_masala": 17,
    "chapati": 18,
    "chhena_kheeri": 19,
    "chicken_razala": 20,
    "chicken_tikka": 21,
    "chicken_tikka_masala": 22,
    "chikki": 23,
    "daal_baati_churma": 24,
    "daal_puri": 25,
    "dal_makhani": 26,
    "dal_tadka": 27,
    "dharwad_pedha": 28,
    "doodhpak": 29,
    "double_ka_meetha": 30,
    "dum_aloo": 31,
    "gajar_ka_halwa": 32,
    "gavvalu": 33,
    "ghevar": 34,
    "gulab_jamun": 35,
    "imarti": 36,
    "jalebi": 37,
    "kachori": 38,
    "kadai_paneer": 39,
    "kadhi_pakoda": 40,
    "kajjikaya": 41,
    "kakinada_khaja": 42,
    "kalakand": 43,
    "karela_bharta": 44,
    "kofta": 45,
    "kuzhi_paniyaram": 46,
    "lassi": 47,
    "ledikeni": 48,
    "litti_chokha": 49,
    "lyangcha": 50,
    "maach_jhol": 51,
    "makki_di_roti_sarson_da_saag": 52,
    "malapua": 53,
    "misi_roti": 54,
    "misti_doi": 55,
    "modak": 56,
    "mysore_pak": 57,
    "naan": 58,
    "navrattan_korma": 59,
    "palak_paneer": 60,
    "paneer_butter_masala": 61,
    "phirni": 62,
    "pithe": 63,
    "poha": 64,
    "poornalu": 65,
    "pootharekulu": 66,
    "qubani_ka_meetha": 67,
    "rabri": 68,
    "ras_malai": 69,
    "rasgulla": 70,
    "sandesh": 71,
    "shankarpali": 72,
    "sheer_korma": 73,
    "sheera": 74,
    "shrikhand": 75,
    "sohan_halwa": 76,
    "sohan_papdi": 77,
    "sutar_feni": 78,
    "unni_appam": 79
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3"
}
